Revit 2027 API
FamilyItemFactory.NewSweptBlendForm Method
Create new Form element by swept blend operation, and add it into the Autodesk Revit family document.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Form NewSweptBlendForm(
	bool isSolid,
	ReferenceArray path,
	ReferenceArrayArray profiles
)
Public Function NewSweptBlendForm (
	isSolid As Boolean,
	path As ReferenceArray,
	profiles As ReferenceArrayArray
) As Form
public:
Form^ NewSweptBlendForm(
	bool isSolid,
	ReferenceArray^ path,
	ReferenceArrayArray^ profiles
)
member NewSweptBlendForm :
        isSolid : bool *
        path : ReferenceArray *
        profiles : ReferenceArrayArray -> Form
Parameters
isSolid Boolean
Indicates if the Form is Solid or Void.
path ReferenceArray
The path of the swept blend. The path should be 2D, where all input curves lie in one plane. If there's more than one profile, the path should be a single curve. It's required to reference existing geometry.
profiles ReferenceArrayArray
The profile set of the newly created swept blend. Each profile should consist of only one curve loop. Each profile must be in a plane that intersects with the path and is perpendicular to the path at the point of intersection.
Return Value
Form
If creation was successful new form is returned.
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace